In [3]:
import pandas as pd
import requests
from datetime import datetime, date

In [ ]:
def get_movies_stats_by_year(db:Session):
    query = db.query(models.Movie.year,func.count(),func.min(models.Movie.duration),func.max(models.Movie.duration),func.avg(models.Movie.duration)).group_by(models.Movie.year).order_by(models.Movie.year).all()
    return [{"year":i[0],"counter":i[1] ,"mini":i[2], "maxi":i[3], "avg":i[4]} for i in query]

In [ ]:
limit = 1500
dfMovies = pd.read_json(f'http://localhost:8000/movies?limit={limit}')
dfMovies.set_index('id', inplace=True)
dfMovies

In [ ]:
type(dfMovies)

In [ ]:
dfStatsMovieByYear = pd.read_json('http://localhost:8000/movies/count_by_year')
dfStatsMovieByYear.columns=['year', 'movie_count']
#dfStatsMovieByYear.set_index('year', inplace=True)
dfStatsMovieByYear

In [ ]:
# le r√©sultat n'est pas fameux
dfStatsMovieByDirector = pd.read_json('http://localhost:8000/stars/stats_movie_by_director')
dfStatsMovieByDirector

In [ ]:
response = requests.get('http://localhost:8000/stars/stats_movie_by_director')
response

In [ ]:
if response.status_code == 200:
    print('Response OK')
else:
    print('Error', response.status_code, response.json(), sep=', ')

In [ ]:
data_json = response.json()
data_json

In [27]:
# applatir en liste de tuples
data_flatten = [ (director_dict['id'], director_dict['name'], director_dict['birthdate'], movie_count )  
         for director_dict, movie_count in data_json ]
data_flatten

[(33, 'Alfred Hitchcock', '1899-08-13', 60),
 (217, 'Martin Scorsese', '1942-11-17', 48),
 (229, 'Steven Spielberg', '1946-12-18', 41),
 (142, 'Clint Eastwood', '1930-05-31', 39),
 (361, 'Brian De Palma', '1940-09-11', 38),
 (631, 'Ridley Scott', '1937-11-30', 35),
 (247, 'John Woo', '1946-09-22', 34),
 (2588606, 'Steve McQueen', '1969-10-09', 31),
 (600, 'Sam Raimi', '1959-10-23', 31),
 (406, 'John Ford', None, 20),
 (1392, 'Peter Jackson', '1961-10-31', 19),
 (965, 'Danny Boyle', '1956-10-20', 18),
 (233, 'Quentin Tarantino', '1963-03-27', 14),
 (116, 'James Cameron', '1954-08-16', 14),
 (250445, 'Walter Edwards', None, 14),
 (102908, 'Robert N. Bradbury', None, 13),
 (634240, 'Christopher Nolan', '1970-07-30', 13),
 (94435, 'Bong Joon Ho', '1969-09-14', 12),
 (1053, 'Ethan Coen', '1957-09-21', 12),
 (1054, 'Joel Coen', '1954-11-29', 11)]

In [33]:
# applatir en list de dicts
data_flatten = [ {**director_dict, 'movie_count': movie_count }  
         for director_dict, movie_count in data_json ]
data_flatten

[{'id': 33,
  'name': 'Alfred Hitchcock',
  'birthdate': '1899-08-13',
  'movie_count': 60},
 {'id': 217,
  'name': 'Martin Scorsese',
  'birthdate': '1942-11-17',
  'movie_count': 48},
 {'id': 229,
  'name': 'Steven Spielberg',
  'birthdate': '1946-12-18',
  'movie_count': 41},
 {'id': 142,
  'name': 'Clint Eastwood',
  'birthdate': '1930-05-31',
  'movie_count': 39},
 {'id': 361,
  'name': 'Brian De Palma',
  'birthdate': '1940-09-11',
  'movie_count': 38},
 {'id': 631,
  'name': 'Ridley Scott',
  'birthdate': '1937-11-30',
  'movie_count': 35},
 {'id': 247, 'name': 'John Woo', 'birthdate': '1946-09-22', 'movie_count': 34},
 {'id': 2588606,
  'name': 'Steve McQueen',
  'birthdate': '1969-10-09',
  'movie_count': 31},
 {'id': 600,
  'name': 'Sam Raimi',
  'birthdate': '1959-10-23',
  'movie_count': 31},
 {'id': 406, 'name': 'John Ford', 'birthdate': None, 'movie_count': 20},
 {'id': 1392,
  'name': 'Peter Jackson',
  'birthdate': '1961-10-31',
  'movie_count': 19},
 {'id': 965,
  'name': 'Danny Boyle',
  'birthdate': '1956-10-20',
  'movie_count': 18},
 {'id': 233,
  'name': 'Quentin Tarantino',
  'birthdate': '1963-03-27',
  'movie_count': 14},
 {'id': 116,
  'name': 'James Cameron',
  'birthdate': '1954-08-16',
  'movie_count': 14},
 {'id': 250445,
  'name': 'Walter Edwards',
  'birthdate': None,
  'movie_count': 14},
 {'id': 102908,
  'name': 'Robert N. Bradbury',
  'birthdate': None,
  'movie_count': 13},
 {'id': 634240,
  'name': 'Christopher Nolan',
  'birthdate': '1970-07-30',
  'movie_count': 13},
 {'id': 94435,
  'name': 'Bong Joon Ho',
  'birthdate': '1969-09-14',
  'movie_count': 12},
 {'id': 1053,
  'name': 'Ethan Coen',
  'birthdate': '1957-09-21',
  'movie_count': 12},
 {'id': 1054,
  'name': 'Joel Coen',
  'birthdate': '1954-11-29',
  'movie_count': 11}]

In [34]:
dfStatsMovieByDirector = pd.DataFrame(data_flatten)
dfStatsMovieByDirector.set_index('id', inplace=True)
dfStatsMovieByDirector

                       name   birthdate  movie_count
id
33         Alfred Hitchcock  1899-08-13           60
217         Martin Scorsese  1942-11-17           48
229        Steven Spielberg  1946-12-18           41
142          Clint Eastwood  1930-05-31           39
361          Brian De Palma  1940-09-11           38
631            Ridley Scott  1937-11-30           35
247                John Woo  1946-09-22           34
2588606       Steve McQueen  1969-10-09           31
600               Sam Raimi  1959-10-23           31
406               John Ford        None           20
1392          Peter Jackson  1961-10-31           19
965             Danny Boyle  1956-10-20           18
233       Quentin Tarantino  1963-03-27           14
116           James Cameron  1954-08-16           14
250445       Walter Edwards        None           14
102908   Robert N. Bradbury        None           13
634240    Christopher Nolan  1970-07-30           13
94435          Bong Joon Ho  1969-09-14           12
1053             Ethan Coen  1957-09-21           12
1054              Joel Coen  1954-11-29           11

In [37]:
dfStatsMovieByDirector.loc[33].birthdate

'1899-08-13'

In [41]:
datetime.strptime('1899-08-13', '%Y-%m-%d').date()

datetime.date(1899, 8, 13)

In [42]:
date.fromisoformat('1899-08-13')

datetime.date(1899, 8, 13)

In [45]:
dfStatsMovieByDirector[dfStatsMovieByDirector.birthdate.isnull()]

                      name birthdate  movie_count
id
406              John Ford      None           20
250445      Walter Edwards      None           14
102908  Robert N. Bradbury      None           13

In [47]:
dfStatsMovieByDirector[~dfStatsMovieByDirector.birthdate.isnull()].birthdate.apply(date.fromisoformat)

id
33         1899-08-13
217        1942-11-17
229        1946-12-18
142        1930-05-31
361        1940-09-11
631        1937-11-30
247        1946-09-22
2588606    1969-10-09
600        1959-10-23
1392       1961-10-31
965        1956-10-20
233        1963-03-27
116        1954-08-16
634240     1970-07-30
94435      1969-09-14
1053       1957-09-21
1054       1954-11-29
Name: birthdate, dtype: object

In [49]:
# def fromisoformat_or_none(dt):
#    return date.fromisoformat(bd) if bd is not None else None

dfStatsMovieByDirector.birthdate = dfStatsMovieByDirector.birthdate.apply(
    lambda bd: date.fromisoformat(bd) if bd is not None else None)
dfStatsMovieByDirector

                       name   birthdate  movie_count
id
33         Alfred Hitchcock  1899-08-13           60
217         Martin Scorsese  1942-11-17           48
229        Steven Spielberg  1946-12-18           41
142          Clint Eastwood  1930-05-31           39
361          Brian De Palma  1940-09-11           38
631            Ridley Scott  1937-11-30           35
247                John Woo  1946-09-22           34
2588606       Steve McQueen  1969-10-09           31
600               Sam Raimi  1959-10-23           31
406               John Ford        None           20
1392          Peter Jackson  1961-10-31           19
965             Danny Boyle  1956-10-20           18
233       Quentin Tarantino  1963-03-27           14
116           James Cameron  1954-08-16           14
250445       Walter Edwards        None           14
102908   Robert N. Bradbury        None           13
634240    Christopher Nolan  1970-07-30           13
94435          Bong Joon Ho  1969-09-14           12
1053             Ethan Coen  1957-09-21           12
1054              Joel Coen  1954-11-29           11

In [50]:
dfStatsMovieByDirector.loc[33].birthdate

datetime.date(1899, 8, 13)

In [54]:
# other idea: instead of apply read column birthdate as datetime64 (NaT)
limit = 1000
dfStars = pd.read_json(f'http://localhost:8000/stars?limit={limit}', convert_dates=['birthdate'])
dfStars.set_index('id', inplace=True)
dfStars

                 name  birthdate
id
1        Fred Astaire 1899-01-01
2       Lauren Bacall 1924-01-01
3     Brigitte Bardot 1934-01-01
4        John Belushi        NaT
6      Ingrid Bergman 1915-01-01
...               ...        ...
1480     Shelley Long        NaT
1484       Jon Lovitz 1957-01-01
1485        Myrna Loy 1905-01-01
1486     Sidney Lumet        NaT
1489       Paul Lynde 1926-01-01

[1000 rows x 2 columns]

In [ ]:
df

In [ ]:
dfStars=pd.read_json(f'http://localhost:8000/stars', convert_dates=['birthdate'])
dfStars.set_index('id',inplace=True)
dfStars

In [ ]:
year = 1962
dfStars=pd.read_json(f'http://localhost:8000/stars/by_birthyear/{year}', convert_dates=['birthdate'])
dfStars.set_index('id',inplace=True)
dfStars

In [ ]:
title = 'Star'
dfStars=pd.read_json('http://localhost:8000/movies/by_title_part?t=' + title, convert_dates=['birthdate'])
dfStars.set_index('id',inplace=True)
dfStars

In [ ]:
response = requests.get('http://localhost:8000/stars/count_by_stars/')
data_json = response.json()

In [ ]:
data_flatten = [ {**director_dict, 'nb_film': nb_film, 'pfilm': pfilm, 'dfilm': dfilm}  
         for director_dict, nb_film, pfilm, dfilm in data_json ]

In [ ]:
dfStatsByStars = pd.DataFrame(data_flatten)
dfStatsByStars.head(15)

In [ ]:
dfCountMovieByYear=pd.read_json("http://localhost:8000/movies/stats_by_year%22)
dfCountMovieByYear

In [ ]:
dfCountMovieByYearGraph=dfCountMovieByYear[dfCountMovieByYear.counter > 15][['year','counter']].set_index('year').plot()
dfCountMovieByYearGraph.set_title('movies by year')
dfCountMovieByYearGraph.set_xlabel('year')
dfCountMovieByYearGraph.set_ylabel('count')
dfCountMovieByYearGraph.set_xlim(1970,2020)

In [ ]:
dfStatMovie=pd.read_json('http://localhost:8000/movies/count_by_year')
dfStatMovie.columns=['year', 'counts']
dfStatMovieGraph = dfStatMovie[dfStatMovie.counts > 15].set_index('year')
dfStatMovieGraph.plot()

In [ ]:
dfStars = pd.read_json('http://localhost:8000/stars', convert_dates = ['birthdate'])
dfStars.set_index('id',inplace=True)
dfStars['year'] = dfStars.birthdate.dt.year
dfCountNameByY = dfStars[['year','name']].groupby(['year']).count()
dfCountNameByY
plt.plot(dfCountNameByY.index, dfCountNameByY.name)
plt.ylabel('Stars Born')

In [ ]:
dfTop10 = dfStatsByStars.head(10)
dfTop10

In [ ]:
dfTop10ByNb = dfTop10[['name','nb_film']]
dfTop10ByNb.set_index('name',inplace=True)
plt.bar(dfTop10ByNb.index, dfTop10ByNb.nb_film)
plt.ylabel('Nombre de film')
plt.xticks(rotation = 90)
dfTop10ByNb.index.to_list()

In [ ]:
fig = plt.figure()
N = 10
w = 0.35

x = np.arange(N)
ax = fig.add_subplot(111)


rect1 = ax.bar(x, dfTop10.pfilm, w,  color ='b')
rect2 = ax.bar(x + w, dfTop10.dfilm, w,  color ='g')

plt.ylim(min(dfTop10.pfilm)-20, max(dfTop10.dfilm)+20)
ax.set_xticks(x + w/2)
ax.set_xticklabels(dfTop10ByNb.index.to_list())
plt.xticks(rotation = 90)
plt.legend(['Date premier film', 'Date dernier film'])
plt.show()